DK7IH/STM32-F4-Demos/_RFM12B/rfm12b_rx.c
    spi_send_word(0x8208);			        // Turn on crystal
	rfm12b_setfreq((433.92 - 430.0)/0.0025);
	rfm12b_setbandwidth(4, 1, 4);			// 200kHz band width, -6dB gain, DRSSI threshold: -79dBm 
	rfm12b_setbaud(19200);					// 19200 baud
	rfm12b_setpower(4, 6);			  	    // 1mW output power, 120kHz frequency shift
    	 
	spi_send_word(0x82C8); //2. Power Management Command, RX on
	 
	//////////////////////////////////////////////
    // Setup USART1 for TX data
    //////////////////////////////////////////////
    RCC->APB2ENR |= (1 << 4);                 //Enable USART1 clock, bit 4 on APB2ENR
    RCC->AHB1ENR |= (1 << 0);                 //Eenable GPIOA clock, bit 0 on AHB1ENR

    //Set pin modes as alternate mode 7 (pins A2 and A3)
    //USART1 TX and RX pins are PA9 (TX) and PA10 (RX) respectively
    GPIOA->MODER &= ~(0b1111 << 18); //Reset bits 19, 18 for PA9 and 21, 20 for PA10
    GPIOA->MODER |=  (0b1010 << 18); //Set   bits 19, 18 for PA9 and 21, 20 for PA10 to alternate mode (10)

    //Set pin modes as fast speed
    GPIOA->OSPEEDR |= 0b1010 << 18; //Set PA9 PA10 to fast speed mode (0b10)

    //Choose AF7 for USART1 in Alternate Function registers
    GPIOA->AFR[1] |= (0x07 << 4); // for pin A9
    GPIOA->AFR[1] |= (0x07 << 8); // for pin A10

    //USART1 word length M, bit 12
    USART1->CR1 |= (0 << 12); // 0 - 1,8,n

    //USART1 parity control, bit 9
    USART1->CR1 |= (0 << 9); // 0 - no parity

    //USART1 TX enable, TE bit 3 
    USART1->CR1 |= (1 << 3);

    // USART1 rx enable, RE bit 2
    USART1->CR1 |= (1 << 2);

    //Baud = fCK / (8 * (2 - OVER8) * USARTDIV)
    //-> USARTDIV = fCK / ((8 * (2 - OVER8) * Baud)
    //-> USARTDIV = 25000000 / ( 16 * 9600)= 156.25
    //Mantissa : 156
    //Fraction : 16*.25 = 4 (multiply fraction with 16)
    
    USART1->BRR |= (156 << 4); // 12-bit mantissa
    USART1->BRR |= 4;          // 4-bit fraction 
        
    ///////////////////////
    // RX Section USART1 //
    ///////////////////////
    //Setup the NVIC to enable interrupts.
    //Use 4 bits for 'priority' and 0 bits for 'subpriority'.
    NVIC_SetPriorityGrouping(0);
    //UART receive interrupts should be high priority.
    NVIC_SetPriority(USART1_IRQn, NVIC_EncodePriority(0, 1, 0));
    NVIC_EnableIRQ(USART1_IRQn);
        
    //TX and RX enable
    USART1->CR1 |= (USART_CR1_RXNEIE);
    USART1->CR1 |= (1 << 13);  //Enable USART1 - UE, bit 13    

    //////////////////////////////////////////
    // Set up I2C - GPIOB 6, 9 for OLED
    //////////////////////////////////////////
    //Enable I2C clock
    RCC->APB1ENR |= (1 << 21); //I2C1 enable

    //Set up I2C PB6 and PB9 pins
    RCC->AHB1ENR |= (1 << 1);         //GPIOB enable
    GPIOB->MODER &= ~(3 << (6 << 1)); //PB6 as SCK
    GPIOB->MODER |=  (2 << (6 << 1)); //Alternate function
    GPIOB->OTYPER |= (1 << 6);        //Open-drain
    GPIOB->MODER &= ~(3 << (9 << 1)); //PB9 as SDA
    GPIOB->MODER |=  (2 << (9 << 1)); //Alternate function
    GPIOB->OTYPER |= (1 << 9);        //Open-drain

    //Choose AF4 for I2C1 in Alternate Function registers
    GPIOB->AFR[0] |= (4 << (6 << 2));     //for PB6
    GPIOB->AFR[1] |= (4 << ((9 - 8) << 2)); //for PB9

    //Reset and clear register
    I2C1->CR1 = (1 << 15); //I2C1 SWRST
    I2C1->CR1 = 0;

    I2C1->CR2 |= (10 << 0); //10Mhz peripheral clock
    I2C1->CCR |= (50 << 0); 
    
    //Maximum rise time defintion
    I2C1->TRISE |= (11 << 0); //Program for value=11 => 100khz
        
    //Enable I2C    
    I2C1->CR1 |= (1 << 0); //PE     
    
    //Start OLED
    oled_init();
    oled_cls(0);
    
    //Get buffer space in memory
    msg_usart1 = (char*)malloc(MAXBUFFER);
    
    //Init text buffer
    for(t1 = 0; t1 < MAXBUFFER; t1++)
    {
		msg_usart1[t1] = 0;
    }
    
    oled_putstring(0, 0, (char*)"RFM12b RX", 0);
    
    while(1)
    { 
		
		if(scomplete1) //Transmission from RFM12b completed -> process string
        {
			oled_putstring(x * FONTW, y, msg_usart1, 0);
		    if(x < 9)
		    {
				x++;
			}
			else
			{
				x = 0;
				if(y < 3)
		        {
				    y++;
			    }
			    else
			    {
				    x = 0;
				    y = 0;
				    oled_cls(0);
			    }
			}		
						
			scomplete1 = 0;
			bufcnt1 = 0;
			for(t1 = 0; t1 < MAXBUFFER; t1++)
            {
		        msg_usart1[t1] = 0;
            }
		}	
		
	}
	return 0;
}
